[
    {
        "name": "Limp Bizkit",
        "details": "Limp Bizkit is an American rap rock band from Jacksonville, Florida. ... Formed in 1994, Limp Bizkit became popular playing in the Jacksonville underground music scene in the late 1990s, and signed with Flip Records, a subsidiary of Interscope, which released the band's debut album, Three Dollar Bill, Y'all (1997)."
    },
    {
        "name": "arctic monkeys",
        "details": "Arctic Monkeys are an English rock band formed in Sheffield in 2002. The group consists of Alex Turner (lead vocals, guitar, keyboards), Jamie Cook (guitar, keyboards), Nick O'Malley (bass guitar, backing vocals), and Matt Helders (drums, backing vocals)."
    },
    {
        "name": "the killers",
        "details": "The Killers are an American rock band formed in Las Vegas in 2001 by Brandon Flowers (lead vocals, keyboards, bass) and Dave Keuning (lead guitar, backing vocals)."
    },
    {
        "name": "kasabian",
        "details": "Are an English rock band formed in Leicester[11] in 1997 by Tom Meighan, Sergio Pizzorno, Chris Karloff, and Chris Edwards. Drummer Ian Matthews joined in 2004. Karloff left the band in 2006 and founded a new band called Black Onassis. Jay Mehler joined as touring lead guitarist in 2006, leaving for Liam Gallaghers Beady Eye in 2013, to be replaced by Tim Carter. Meighan left the band in July 2020."
    },
    {
        "name": "red hot chili peppers",
        "details": "Red Hot Chili Peppers are an American rock band formed in Los Angeles in 1983. The group's musical style primarily consists of alternative rock with an emphasis on funk, as well as elements from other genres such as punk rock and psychedelic rock."
    },
    {
        "name": "the pixies",
        "details": "The Pixies are an American alternative rock band formed in 1986 in Boston, Massachusetts. Until 2013, the band comprised Black Francis (vocals, rhythm guitar, songwriter), Joey Santiago (lead guitar), Kim Deal (bass, backing vocals) and David Lovering (drums). The band disbanded acrimoniously in 1993 but reunited in 2004. After Deal left in 2013, the Pixies hired Kim Shattuck as a touring bassist; she was replaced the same year by Paz Lenchantin, who became a permanent member in 2016."
    },
    {
        "name": "The Heavy",
        "details": "The Heavy are an English rock band from Bath, Somerset, England, formed in 2007. They have released four albums as well as a wide array of singles. Their music has been widely used in the media, with their 2009 single \"How You Like Me Now?\" becoming their biggest hit."
    }
]